# Лабораторная работа - Реализация DHCPv4
## Топология

![topology]()

## Таблица адресации 

| Устройство  | Интерфейс  | IPv6-адрес | Маска подсети |
| :------ |:------------:| --------:| ---------------:|
| R1      | G0/0/1       | 192.168.10.1    | 255.255.255.0 |
| R1      | Loopback 0   | 10.10.1.1       | 255.255.255.0 |
| S1      | VLAN 10      | 192.168.10.201  | 255.255.255.0 |
| S2      | VLAN 10      | 192.168.10.202  | 255.255.255.0 |
| PC-A    | NIC          | DHCP     | 255.255.255.0 |
| PC-B    | NIC          | DHCP     | 255.255.255.0 |


## Задачи:

### Часть 1. Создание сети и настройка основных параметров устройства.

### Часть 2. Настройка сетей VLAN.

### Часть 3. Настройки безопасности коммутатора.

## Решение:

### Часть 1. Создание сети и настройка основных параметров устройства.

#### Шаг 1.	Создаем сеть согласно топологии (см.пункт "Топология") и инициализация устройств.

#### Шаг 2. Настройте маршрутизатор R1:

  1. Загрузите следующий конфигурационный скрипт на R1:

    enable
    configure terminal
    hostname R1
    no ip domain lookup
    ip dhcp excluded-address 192.168.10.1 192.168.10.9
    ip dhcp excluded-address 192.168.10.201 192.168.10.202
    !
    ip dhcp pool Students
     network 192.168.10.0 255.255.255.0
     default-router 192.168.10.1
     domain-name CCNA2.Lab-11.6.1
    !
    interface Loopback0
     ip address 10.10.1.1 255.255.255.0
    !
    interface GigabitEthernet0/0/1
     description Link to S1
     ip dhcp relay information trusted
     ip address 192.168.10.1 255.255.255.0
     no shutdown
    !
    line con 0
     logging synchronous
     exec-timeout 0 0


  2. Проверьте текущую конфигурацию на R1, используя следующую команду **show ip interface brief**:

![int_brief]()

#### Шаг 3. Настройка и проверка основных параметров коммутатора:

  1.	Настройте имя хоста для коммутаторов S1 и S2.
  2.	Запретите нежелательный поиск в DNS.
  3.	Настройте описания интерфейса для портов, которые используются в S1 и S2.
  4.	Установите для шлюза по умолчанию для VLAN управления значение 192.168.10.1 на обоих коммутаторах.

  ###### S1:

    Switch>en
    Switch#conf t
    Switch(config)#hostname S1
    S1(config)#ip domain-lookup
    S1(config)#int fa 0/5
    S1(config-if)#description To-R1
    S1(config-if)#int fa 0/6
    S1(config-if)#description To-PC-A
    S1(config-if)#int fa 0/1
    S1(config-if)#description To-S2
    S1(config-if)#exit
    S1(config)#ip default-gateway 192.168.10.1

  ###### S2:

    Switch>en
    Switch#conf t
    Switch(config)#hostname S2
    S2(config)#int fa 0/1
    S2(config-if)#desc To-S1
    S2(config-if)#int fa 0/18
    S2(config-if)#desc To-PC-B
    S2(config-if)#ex
    S2(config)#ip domain-lookup
    S2(config)#ip default-gateway 192.168.10.1

### Часть 2. Настройка сетей VLAN.

#### Шаг 1. Сконфигруриуйте VLAN 10:

  1. S1:
    
    S1(config)#vlan 10
    S1(config-vlan)#name Management

  2. S2:

    S2(config)#vlan 10
    S2(config-vlan)#name Management

#### Шаг 2. Сконфигруриуйте SVI для VLAN 10:

  1. S1:

    S1(config-vlan)#int vlan 10
    S1(config-if)#ip addr 192.168.10.201 255.255.255.0
    S1(config-if)#no sh
    S1(config-if)#description Mangement-SVI

  2. S2:

    S2(config-vlan)#int vlan 10
    S2(config-if)#ip addr 192.168.10.202 255.255.255.0
    S2(config-if)#no sh
    S2(config-if)#description Mangement-SVI




































