# Лабораторная работа - Реализация DHCPv4
## Топология

![topology]()

## Таблица адресации 

| Устройство  | Интерфейс  | IPv6-адрес | Маска подсети |
| :------ |:------------:| --------:| ---------------:|
| R1      | G0/0/1       | 192.168.10.1    | 255.255.255.0 |
| R1      | Loopback 0   | 10.10.1.1       | 255.255.255.0 |
| S1      | VLAN 10      | 192.168.10.201  | 255.255.255.0 |
| S2      | VLAN 10      | 192.168.10.202  | 255.255.255.0 |
| PC-A    | NIC          | DHCP     | 255.255.255.0 |
| PC-B    | NIC          | DHCP     | 255.255.255.0 |


## Задачи:

### Часть 1. Создание сети и настройка основных параметров устройства.

### Часть 2. Настройка сетей VLAN.

### Часть 3. Настройки безопасности коммутатора.

## Решение:

### Часть 1. Создание сети и настройка основных параметров устройства.

#### Шаг 1.	Создаем сеть согласно топологии (см.пункт "Топология") и инициализация устройств.

#### Шаг 2. Настройте маршрутизатор R1:

  1. Загрузите следующий конфигурационный скрипт на R1:

    enable
    configure terminal
    hostname R1
    no ip domain lookup
    ip dhcp excluded-address 192.168.10.1 192.168.10.9
    ip dhcp excluded-address 192.168.10.201 192.168.10.202
    !
    ip dhcp pool Students
     network 192.168.10.0 255.255.255.0
     default-router 192.168.10.1
     domain-name CCNA2.Lab-11.6.1
    !
    interface Loopback0
     ip address 10.10.1.1 255.255.255.0
    !
    interface GigabitEthernet0/0/1
     description Link to S1
     ip dhcp relay information trusted
     ip address 192.168.10.1 255.255.255.0
     no shutdown
    !
    line con 0
     logging synchronous
     exec-timeout 0 0


  2. Проверьте текущую конфигурацию на R1, используя следующую команду **show ip interface brief**:

![int_brief]()

#### Шаг 3. Настройка и проверка основных параметров коммутатора:

  1.	Настройте имя хоста для коммутаторов S1 и S2.
  2.	Запретите нежелательный поиск в DNS.
  3.	Настройте описания интерфейса для портов, которые используются в S1 и S2.
  4.	Установите для шлюза по умолчанию для VLAN управления значение 192.168.10.1 на обоих коммутаторах.

  ###### S1:

    Switch>en
    Switch#conf t
    Switch(config)#hostname S1
    S1(config)#ip domain-lookup
    S1(config)#int fa 0/5
    S1(config-if)#description To-R1
    S1(config-if)#int fa 0/6
    S1(config-if)#description To-PC-A
    S1(config-if)#int fa 0/1
    S1(config-if)#description To-S2
    S1(config-if)#exit
    S1(config)#ip default-gateway 192.168.10.1

  ###### S2:

    Switch>en
    Switch#conf t
    Switch(config)#hostname S2
    S2(config)#int fa 0/1
    S2(config-if)#desc To-S1
    S2(config-if)#int fa 0/18
    S2(config-if)#desc To-PC-B
    S2(config-if)#ex
    S2(config)#ip domain-lookup
    S2(config)#ip default-gateway 192.168.10.1

### Часть 2. Настройка сетей VLAN.

#### Шаг 1. Сконфигруриуйте VLAN 10:

  1. S1:
    
    S1(config)#vlan 10
    S1(config-vlan)#name Management

  2. S2:

    S2(config)#vlan 10
    S2(config-vlan)#name Management

#### Шаг 2. Сконфигруриуйте SVI для VLAN 10:

  1. S1:

    S1(config-vlan)#int vlan 10
    S1(config-if)#ip addr 192.168.10.201 255.255.255.0
    S1(config-if)#no sh
    S1(config-if)#description Mangement-SVI

  2. S2:

    S2(config-vlan)#int vlan 10
    S2(config-if)#ip addr 192.168.10.202 255.255.255.0
    S2(config-if)#no sh
    S2(config-if)#description Mangement-SVI


#### Шаг 3. Настройте VLAN 333 с именем Native на S1 и S2:

  1. S1:

    S1(config)#vlan 333
    S1(config-vlan)#name Native

  2. S2:

    S2(config)#vlan 333
    S2(config-vlan)#name Native

#### Шаг 4. Настройте VLAN 999 с именем ParkingLot на S1 и S2:

  1. S1:

    S1(config-vlan)#vlan 999
    S1(config-vlan)#name ParkingLot

  2. S2:

    S2(config-vlan)#vlan 999
    S2(config-vlan)#name ParkingLot


### Часть 3. Настройки безопасности коммутатора.

#### Шаг 1. Релизация магистральных соединений 802.1Q:

  1. Настройте все магистральные порты Fa0/1 на обоих коммутаторах для использования VLAN 333 в качестве native VLAN.

  1.1. S1:

    S1(config-vlan)#int f0/1
    S1(config-if)#switchport mode trunk
    S1(config-if)#switchport trunk native vlan 333

  1.2. S2:

    S2(config-vlan)#int f0/1
    S2(config-if)#switchport mode trunk
    S2(config-if)#switchport trunk native vlan 333

  2.	Убедитесь, что режим транкинга успешно настроен на всех коммутаторах (**show interface trunk**):

![sh_int_trunk]()

  3.	Отключить согласование DTP F0/1 на S1 и S2

  3.1. S1:
    
    S1(config-if)#switchport nonegotiate

  3.2. S2:
    
    S2(config-if)#switchport nonegotiate

  4.	Проверьте с помощью команды **show interfaces**:

###### S1:

  ![sh_int_S1]()

###### S2:

  ![sh_int_S2]()


#### Шаг 2. Настройка портов доступа:

  1.	На S1 настройте F0/5 и F0/6 в качестве портов доступа и свяжите их с VLAN 10:

    S1(config-if)#int range f0/5-6
    S1(config-if-range)#switchport mode access
    S1(config-if-range)#switchport access vlan 10

  2.	На S2 настройте порт доступа Fa0/18 и свяжите его с VLAN 10:

    S2(config-if)#int f0/18
    S2(config-if)#switchport mode access
    S2(config-if)#switchport access vlan 10

#### Шаг 3. Безопасность неиспользуемых портов коммутатора:

1.	На S1 и S2 переместите неиспользуемые порты из VLAN 1 в VLAN 999 и отключите неиспользуемые порты:

  1.1. S1:
    
    S1(config)#int range f0/2-17,f0/19-24,g0/1-2
    S1(config-if-range)#switchport mode access
    S1(config-if-range)#switchport access vlan 999
    S1(config-if-range)#shutdown

  1.2. S2:

    S2(config)#int range f0/2-4,f0/7-24,g0/1-2
    S2(config-if-range)#switchport mode access
    S2(config-if-range)#switchport access vlan 999
    S2(config-if-range)#shutdown

2.	Убедитесь, что неиспользуемые порты отключены и связаны с VLAN 999, введя команду **show interfaces status**:

  2.1. S1:

  ![sh_int_Stat_S1]()

  2.2. S2:

  ![sh_int_Stat_S2]()    

#### Шаг 4. Документирование и реализация функций безопасности порта:

1.	На S1, введите команду **show port-security interface f0/6**  для отображения настроек по умолчанию безопасности порта для интерфейса F0/6. Запишите свои ответы ниже:

| Функция | Настройка по умолчанию |
| :------ |:------------:| 
| Защита портов      | Disabled | 
| Максимальное количество записей MAC-адресов | 1 |
| Режим проверки на нарушение безопасности | Shutdown |
| Aging Time | 0 mins |
| Aging Type | Absolute |
| Secure Static Address Aging | Disabled |
| Sticky MAC Address | 0|

2.	На S1 включите защиту порта на F0/6 со следующими настройками:

| <!-- -->      |
|:-------------:|
| Максимальное количество записей MAC-адресов: 3     |
| Режим безопасности: restrict |
| Aging time: 60 мин |
| Aging type: неактивный - Pocket Tracer не поддерживает даную функцию :(  |

    S1(config-if)#switchport port-sec
    S1(config-if)#switchport port-security maximum 3
    S1(config-if)#switchport port-sec violation restrict
    S1(config-if)#switchport port-sec aging time 60

3.	Verify port security on S1 F0/6:

![sh_port-sec_int_S1]()

![sh_port_add_S1]()


4.	Включите безопасность порта для F0 / 18 на S2. Настройте каждый активный порт доступа таким образом, чтобы он автоматически добавлял адреса МАС, изученные на этом порту, в текущую конфигурацию:

    S2(config)#int fa 0/18
    S2(config-if)#switchport port-security
    S2(config-if)#switchport port-security mac-address sticky


5.	Настройте следующие параметры безопасности порта на S2 F / 18:

| <!-- -->      |
|:-------------:|
| Максимальное количество записей MAC-адресов: 2     |
| Тип безопасности: Protect |
| Aging time: 60 мин |

    S2(config-if)#sw port-sec maximum 2
    S2(config-if)#sw port-sec viol protect
    S2(config-if)#sw port-sec aging time 60

6.	Проверка функции безопасности портов на S2 F0/18:

![sh_port-sec_int_S2]()

![sh_port_add_S2]()

#### Шаг 5. Реализовать безопасность DHCP snooping.

1. На S2 включите DHCP snooping и настройте DHCP snooping во VLAN 10.
2. Настройте магистральные порты на S2 как доверенные порты.
3. Ограничьте ненадежный порт Fa0/18 на S2 пятью DHCP-пакетами в секунду.

    S2(config)#ip dhcp snooping vlan 10
    S2(config)#int f0/1
    S2(config-if)#ip dhcp snooping trust
    S2(config-if)#int f0/18
    S2(config-if)#ip dhcp snooping limit rate 5

4. Проверка DHCP Snooping на S2:

![sh_ip_dhcp_S2]()

5.	В командной строке на PC-B освободите, а затем обновите IP-адрес:

    C:\Users\Student> ipconfig /release
    C:\Users\Student> ipconfig /renew

![ipcon_PC-B]()

6.	Проверьте привязку отслеживания DHCP с помощью команды **show ip dhcp snooping binding**:

![sh_ip_S2_bind]()

#### Шаг 6. Реализация PortFast и BPDU Guard:

1.	Настройте PortFast на всех портах доступа, которые используются на обоих коммутаторах:

    S1(config)#int ra f0/5-6
    S1(config-if-range)#spanning-tree portfast

2.	Включите защиту BPDU на портах доступа VLAN 10 S1 и S2, подключенных к PC-A и PC-B:

    S1(config-if)#spanning-tree bpduguard enable

#### Шаг 7. Проверьте наличие сквозного ⁪подключения:

1. Проверьте **PING** свзяь между всеми устройствами в таблице IP-адресации. В случае сбоя проверки связи может потребоваться отключить брандмауэр на хостах

![ping_PC-B]()
















